Revit 2027 API
FabricationPart.ProductFinishDescription Property
 The product finish description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductFinishDescription { get; }
Public ReadOnly Property ProductFinishDescription As String
	Get
public:
property String^ ProductFinishDescription {
	String^ get ();
}
member ProductFinishDescription : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace